const UserAgreement = () => (
    <div style={{ padding: '20px' }}>
        <h2>Пользовательское соглашение</h2>
        <p><strong>Настоящее Пользовательское Соглашение</strong> (далее – Соглашение) регулирует отношения между ИП Абраамян В.Л. (далее – МебельRyм или Администрация) с одной стороны и пользователем сайта с другой.</p>

        <p>Сайт МебельRyм не является средством массовой информации.</p>

        <p>Используя сайт, Вы соглашаетесь с условиями данного соглашения. Если Вы не согласны с условиями данного соглашения, не используйте сайт МебельRyм!</p>

        <h3>Права и обязанности сторон</h3>
        <p><strong>Пользователь имеет право:</strong></p>
        <ul>
            <li>осуществлять поиск информации на сайте</li>
            <li>получать информацию на сайте</li>
            <li>создавать информацию для сайта</li>
            <li>распространять информацию на сайте</li>
            <li>комментировать контент, выложенный на сайте</li>
            <li>копировать информацию на другие сайты с указанием источника или с разрешения Администрации сайта</li>
            <li>требовать от администрации скрытия любой информации о пользователе или переданной пользователем сайту</li>
            <li>использовать информацию сайта в личных некоммерческих целях или с разрешения Администрации/правообладателей в коммерческих целях</li>
        </ul>

        <p><strong>Администрация имеет право:</strong></p>
        <ul>
            <li>создавать, изменять, отменять правила</li>
            <li>ограничивать доступ к информации на сайте</li>
            <li>удалять учетные записи</li>
            <li>отказывать в регистрации без объяснения причин</li>
        </ul>

        <p><strong>Пользователь обязуется:</strong></p>
        <ul>
            <li>обеспечить достоверность предоставляемой информации</li>
            <li>обеспечивать сохранность личных данных</li>
            <li>обновлять персональные данные при изменении</li>
            <li>не копировать и не размещать запрещённую информацию</li>
            <li>не нарушать работоспособность сайта</li>
            <li>не использовать несколько аккаунтов или чужие учетные данные</li>
            <li>не использовать скрипты для автоматизированного взаимодействия с сайтом</li>
        </ul>

        <p><strong>Администрация обязуется:</strong></p>
        <ul>
            <li>поддерживать работоспособность сайта</li>
            <li>осуществлять защиту учетной записи и конфиденциальной информации</li>
            <li>предоставлять данные о пользователе госорганам в рамках закона</li>
        </ul>

        <h3>Ответственность сторон</h3>
        <ul>
            <li>Администрация не несет ответственности за услуги, предоставляемые третьими лицами</li>
            <li>В случае форс-мажора Администрация не гарантирует сохранность информации и стабильность работы ресурса</li>
        </ul>

        <h3>Условия действия Соглашения</h3>
        <p>Соглашение вступает в силу при регистрации на сайте. Действует до появления новой версии. Администрация вправе вносить изменения без уведомления пользователей.</p>
    </div>
);

export default UserAgreement;
